#**************************************************************************
#04-06
#**************************************************************************

#=====================================
#インポート
#=====================================
import random

#=====================================
#クラス定義
#=====================================
class Player:
    def __init__(self, name,coin):
        self.name = name
        self.coin = coin
    
    def info(self):
        print(self.name + '：' + str(self.coin))


class Human(Player):
    def __init__(self, name,coin):
        super().__init__(name,coin)
    
    def bet(self):
        bet_coin = input('何枚BETしますか？：（1-99）')
        print('デバッグログ：' + str(bet_coin))


#=====================================
#関数定義
#=====================================

#
def play():
    
    print('デバッグログ：play()')
    Human01 = Human('MY',500)
    Human01.info()
    Human01.bet()

#=====================================
#本編
#=====================================
play()






